'''
5. Программа запрашивает у пользователя строку чисел,
 разделённых пробелом. При нажатии Enter должна выводиться сумма чисел.
 Пользователь может продолжить ввод чисел, разделённых пробелом и снова нажать Enter.
 Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.

Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введён после нескольких чисел, то вначале нужно добавить
сумму этих чисел к полученной ранее сумме и после этого завершить программу.
'''


def my_func(args):
    while True:
        my_str = input('Введите числа через пробел. Для выхода напишите 000').split()
        if my_str == 000:
            break
        else:
            i = 0
            for number in my_str:
                number = int(number)
                my_list.append(number)
                result = sum(my_list)
                i += 1
        print(result)
        continue


my_list = []
print(my_func(my_list))
